In [1]:
import pandas as pd 
import numpy as np

In [2]:
Poverty = pd.read_csv("poverty.csv")

print(Poverty)
Poverty.head()

                                            Unnamed: 0  \
0                                          Afghanistan
1                                              Albania
2                                              Algeria
3                                       American Samoa
4                                              Andorra
..                                                 ...
253                                   General comments
254  The World Bank’s internationally comparable po...
255                                                NaN
256                                                NaN
257  Please see the online table at http://wdi.worl...

    Population below $1.90 a day Population below $3.20 a day  \
0                             ..                           ..
1                            1.7                         10.4
2                            0.5                          3.9
3                             ..                           ..
4                             ..                           ..
..                           ...                          ...
253                          NaN                          NaN
254                          NaN                          NaN
255                          NaN                          NaN
256                          NaN                          NaN
257                          NaN                          NaN

    Population below $5.50 a day
0                             ..
1                             38
2                           29.2
3                             ..
4                             ..
..                           ...
253                          NaN
254                          NaN
255                          NaN
256                          NaN
257                          NaN

[258 rows x 4 columns]

,Unnamed: 0,Population below $1.90 a day,Population below $3.20 a day,Population below $5.50 a day
0,Afghanistan,..,..,..
1,Albania,1.7,10.4,38
2,Algeria,0.5,3.9,29.2
3,American Samoa,..,..,..
4,Andorra,..,..,..

In [8]:
Poverty.dropna()

,Unnamed: 0,Population below $1.90 a day,Population below $3.20 a day,Population below $5.50 a day
0,Afghanistan,..,..,..
1,Albania,1.7,10.4,38
2,Algeria,0.5,3.9,29.2
3,American Samoa,..,..,..
4,Andorra,..,..,..
...,...,...,...,...
211,Virgin Islands (U.S.),..,..,..
212,West Bank and Gaza,1,5,23.6
213,"Yemen, Rep.",18.8,52.2,81.6
214,Zambia,57.5,74.3,87.2
215,Zimbabwe,33.9,61,81.3

In [15]:
Cleaned_Poverty = Poverty.rename(columns= {'Unnamed: 0':'Country', 
                                    'Unnamed: 2':'% Pop. Below $1.90 per day',
                                    'Unnamed: 3':'% Pop. Below $3.20 per day',
                                    'Unnamed: 4':'% Pop. Below $5.50 per day'
                                   })
Cleaned_Poverty.head()

,Country,Population below $1.90 a day,Population below $3.20 a day,Population below $5.50 a day
0,Afghanistan,..,..,..
1,Albania,1.7,10.4,38
2,Algeria,0.5,3.9,29.2
3,American Samoa,..,..,..
4,Andorra,..,..,..

In [16]:
Cleaned_Poverty.to_json(r"Cleaned_Poverty_Data.json")